ГТС/УТГТС/InformationRegisters/СервисСверкиРасчетовСтатусыРасхождений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СервисСверкиРасчетовСтатусыРасхождений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЭтоНовоеРасхождение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторРасхождения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>38</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ГТС/УТГТС/InformationRegisters/СервисСверкиРасчетовСтатусыРасхождений/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаписатьДанные(ИдентификаторыНовыхРасхождений) Экспорт 
	
	Для Каждого ИдентификаторРасхождения Из ИдентификаторыНовыхРасхождений Цикл
		
		МенеджерЗаписи = РегистрыСведений.СервисСверкиРасчетовСтатусыРасхождений.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ИдентификаторРасхождения = ИдентификаторРасхождения;
		МенеджерЗаписи.ЭтоНовоеРасхождение = Истина;
		
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Функция ОчиститьСтатусыРасхождений() Экспорт
	
	НаборЗаписейРасхождения= РегистрыСведений.СервисСверкиРасчетовСтатусыРасхождений.СоздатьНаборЗаписей();
	НаборЗаписейРасхождения.Записать();
	
КонецФункции

#КонецОбласти

#КонецЕсли
